.586 ;Вказуемо покоління процесора;
.model flat, stdcall	;
.stack
.data
; Оголошуемо змінні, які будуть брати участь в обчисленні;
a dw ?  ; У а буде записано результат;
d dw 3 ; d дорівнює 10;
f dw 6  ; f дорівнює 5;
b dw 2 ; b дорівнює 11;
; Закінчуємо оголошувати змінні;
.code

Begin: ; Оголошуемо початок лістингу командд;

xor eax,eax ;Очищуемо регистр eax;
xor ebx,ebx	;Очищуемо регистр ebx;
xor edx,edx	;Очищуемо регистр edx;

Mov ax, b ; ax[b] ; Відправляємо змінну b у регістр ax;
Add ax, 1 ; ax[b+1] ; Виконуємо операцію додавання b + 1;
Mov bx, 6 ; bx[6] ; Відправляємо число 6 у регістр bx;
IDiv bl   ; bl[12/6] ; Виконуємо операцію ділення 12 / 6;
Mov dx, 0 ; dx[0]

Mov dx, f  ; dx[f] ; Відправляємо змінну f у герістр dx;
IMul dx, 2 ; dx[2*f] ; Виконуємо операцію множення 2 * f;

Add dx, d  ; dx[2f+d] ; Виконуємо операцію додавання 2f + d;
Add dx, ax ; dx[d+2*f+(b+1)/6] ; Виконуємо операцію додавання результату;

Mov a, dx  ; Пересилаємо результат у змінну а

end Begin